Show / Hide Table of Contents
Class MaterialParam
Parameter which represts the record of the material in IDEA MPRL
Inheritance
System.Object
MprlRecord
MaterialParam
Inherited Members
 MprlRecord.Name
 MprlRecord.TableId
 MprlRecord.ItemId
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
[Serializable]
public class MaterialParam : MprlRecord
 Improve this Doc
 View Source